PLAYERS_COUNT = 10
THINGS_COUNT = 20

THING_NAMES = [
    'Кольцо власти',
    'Мантия невидимка',
    'Ковер самолет',
    'Самбрерро судьбы',
    'Меч круче гор',
    'Меч леденец',
    'Ножик-ежик',
    'Тапки самоходки',
    'Боевые трусы',
    'Носки невиданной защиты',
    'Перстень величия',
    'Халат крутости',
    'Чепчик двойной атаки',
    'Палка-убивалка',
    'Щит обычный',
    'Щит необычный',
    'Перчатки хваталки',
    'Штаны прыгуны',
    'Галоши воина',
    'Сапоги из чешуи дракона',
    'Булава справедливости',
]

PLAYERS_NAMES = [
    'Биба',
    'Боба',
    'Халк',
    'Буратино',
    'Терминатор',
    'Железный Арни',
    'Рокки',
    'ДАмагаров',
    'Налоговая',
    'Груз ответственности',
    'Яндекс Практикум',
    'Лю Кэнг',
    'Саб Зиро',
    'Кинг Конг',
    'Годзилла',
    'Котик',
    'Том Круз',
    'Сессия',
    'Угол Тумбочки',
    'Ниндзя',
    'Боевой Вертолет',
]

BASE_HP = 100
BASE_ATTACK = 5
BASE_PROTECTION = 1  # значение в процентах